## Students Marks Analysis

In [5]:
import pandas as pd
import numpy as np

In [4]:
data = pd.read_csv("data/marksheet.csv")
data

      id      Name  Gender  Age Section  Science  English  History  Maths
0      1   Bronnie  Female   13       C       21       81       62     49
1      2    Lemmie    Male   15       B       29       41       17     40
2      3     Danya  Female   14       C       12       87       16     96
3      4     Denna  Female   14       B       15       53       82     33
4      5   Jocelin    Male   14       A       43        6        3     21
..   ...       ...     ...  ...     ...      ...      ...      ...    ...
245  246    Nickie    Male   13       C       28       15       25     10
246  247       Rog  Female   13       B        1        4       68     65
247  248      Kaia    Male   15       B       93       48       82     44
248  249      Anni  Female   14       B       35       73       66     59
249  250  Fernande    Male   15       B       50        8       80     78

[250 rows x 9 columns]

In [10]:
min = np.min(data["Age"], axis=0 )
print(min)

13

In [11]:
max = np.max(data["Age"], axis=0 )
print(max)

15

In [52]:
data.iloc[: , 6:].sum(axis=1)

0      405
1      225
2      410
3      351
4      103
      ...
245    128
246    275
247    441
248    431
249    382
Length: 250, dtype: int64

In [41]:
data["Total"] = data[ ["Science" ,"English" , "History" , "Maths"]].sum(axis=1)
data

,id,Name,Gender,Age,Section,Science,English,History,Maths,Total
0,1,Bronnie,Female,13,C,21,81,62,49,213
1,2,Lemmie,Male,15,B,29,41,17,40,127
2,3,Danya,Female,14,C,12,87,16,96,211
3,4,Denna,Female,14,B,15,53,82,33,183
4,5,Jocelin,Male,14,A,43,6,3,21,73
...,...,...,...,...,...,...,...,...,...,...
245,246,Nickie,Male,13,C,28,15,25,10,78
246,247,Rog,Female,13,B,1,4,68,65,138
247,248,Kaia,Male,15,B,93,48,82,44,267
248,249,Anni,Female,14,B,35,73,66,59,233
249,250,Fernande,Male,15,B,50,8,80,78,216

In [57]:
data[ ["Science" ,"English" , "History" , "Maths"]].mean( axis=1)

0      53.25
1      31.75
2      52.75
3      45.75
4      18.25
       ...
245    19.50
246    34.50
247    66.75
248    58.25
249    54.00
Length: 250, dtype: float64

In [ ]:
# adding average column

data["Average"] = data[ ["Science" ,"English" , "History" , "Maths"]].mean(axis=1)
data

,id,Name,Gender,Age,Section,Science,English,History,Maths,Total,Average
0,1,Bronnie,Female,13,C,21,81,62,49,213,53.25
1,2,Lemmie,Male,15,B,29,41,17,40,127,31.75
2,3,Danya,Female,14,C,12,87,16,96,211,52.75
3,4,Denna,Female,14,B,15,53,82,33,183,45.75
4,5,Jocelin,Male,14,A,43,6,3,21,73,18.25
...,...,...,...,...,...,...,...,...,...,...,...
245,246,Nickie,Male,13,C,28,15,25,10,78,19.50
246,247,Rog,Female,13,B,1,4,68,65,138,34.50
247,248,Kaia,Male,15,B,93,48,82,44,267,66.75
248,249,Anni,Female,14,B,35,73,66,59,233,58.25
249,250,Fernande,Male,15,B,50,8,80,78,216,54.00

In [75]:
# Sorting by average

avg = data["Average"].sort_values(axis=0).index
n = data.loc[ avg , ["Name" , "Average"]]
n

         Name  Average
228  Ginnifer    14.25
19     Ashlan    16.75
225     Blake    17.50
4     Jocelin    18.25
137    Berget    18.25
..        ...      ...
200    Ruddie    83.25
91      Daffi    85.25
68        Nil    86.75
120  Patrizia    89.00
10       Dunn    90.25

[250 rows x 2 columns]